---
kind: type
id: T:Autodesk.Revit.DB.Visual.CeramicType
source: html/a0616b59-6e5a-714d-85cc-8fcab64b84b4.htm
---
# Autodesk.Revit.DB.Visual.CeramicType

The enumerated type representing the permitted values for the asset property "CeramicType" from the "Ceramic" schema.

## Syntax (C#)
```csharp
public enum CeramicType
```